import { publicProcedure } from '@/trpc/server';

export const listOfFeatures = publicProcedure.query(() => {
  return [
    {
      name: 'مدیریت مشتریان',
      description:
        'با قابلیت‌های پیشرفته، می‌توانید تمامی اطلاعات مشتریان خود را به راحتی مدیریت کنید. از تاریخچه ملاقات‌ها تا یادآوری‌های مهم، همه‌چیز در یک جا در دسترس است.',
      logo: 'TablerUsersGroup',
    },
    {
      name: 'نوبت‌دهی آنلاین',
      description:
        'مشتریان می‌توانند به راحتی از طریق وب‌سایت یا اپلیکیشن شما نوبت بگیرند. این ویژگی باعث صرفه‌جویی در وقت و افزایش راحتی برای مشتریان می‌شود.',
      logo: 'TablerCalendarCheck',
    },
    {
      name: 'مدیریت خدمات',
      description:
        'فهرستی کامل از خدمات خود را به همراه قیمت‌ها و توضیحات مربوطه مدیریت کنید. می‌توانید خدمات جدید اضافه کنید و یا اطلاعات موجود را ویرایش کنید.',
      logo: 'TablerHotelService',
    },
    {
      name: 'گزارش‌ گیری و تحلیل',
      description:
        'با استفاده از گزارش‌های دقیق، می‌توانید عملکرد کسب‌وکار خود را تحلیل کنید. از تعداد نوبت‌ها تا درآمد، همه اطلاعات به صورت بصری قابل مشاهده است.',
      logo: 'TablerChartDonut',
    },
    {
      name: 'ارتباط با مشتریان',
      description:
        'با ارسال پیامک‌ها یا ایمیل‌های خودکار، می‌توانید با مشتریان خود در ارتباط باشید. این ارتباط به حفظ مشتریان و افزایش رضایت آن‌ها کمک می‌کند.',
      logo: 'TablerBubbleText',
    },
    {
      name: 'نرم‌افزار کاربرپسند',
      description:
        'رابط کاربری ساده و قابل فهم به شما این امکان را می‌دهد که به راحتی با نرم‌افزار کار کنید و به سرعت به اطلاعات مورد نیاز خود دسترسی پیدا کنید.',
      logo: 'TablerBrandRadixUi',
    },
  ];
});
